### Starter code for Project 3. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [1]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [2]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'biohackers-434920:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access-2/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r6c459244d0bc7c77_00000192c5b7618f_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r2be77241f8d6ee56_00000192c5b77439_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_ra86b8d2ef63b7b5_00000192c5b78f9d_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r7c64d39d60fda7e5_00000192c5b7bf4f_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r4d9d58ab3d8c9f78_00000192c5b7d639_1 ... (3s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r4eea399bac1477a7_00000192c5b7ec8b_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r2c4e648677b5710b_00000192c5b8080a_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r23cea0964b7cfc3f_00000192c5b819e3_1 ... (6s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r3e4c4a9bd13855cb_00000192c5b83cda_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r33e0f468d6784385_00000192c5b84eea_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r7f6cd713002bc839_00000192c5b860e3_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r3283d1870fd5e728_00000192c5b87421_1 ... (4s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r7851c8d2772f4481_00000192c5b88fa6_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_r512b6b2d0a7effdb_00000192c5b8a9eb_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r1359da923b6b98d5_00000192c5b8bc1b_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r48171e3f5f7713a2_00000192c5b8dace_1 ... (5s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r6e46263b446394_00000192c5b8f993_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   4320
1     AKINS H S          grade_10  2021   4482
2     AKINS H S          grade_11  2020   3984
3     AKINS H S          grade_11  2021   3978
4     AKINS H S          grade_12  2020   3654
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    414
1735  ZILKER EL      kindergarten  2020    462
1736  ZILKER EL      kindergarten  2021    378
1737  ZILKER EL  pre_kindergarten  2020    180
1738  ZILKER EL  pre_kindergarten  2021     78

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [7]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'biohackers-434920:views' already
exists.

In [8]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: 867f9646-65c1-44df-b4e0-fcb86ce9c296
Query executing: 0.29s

ERROR:
 409 GET https://bigquery.googleapis.com/bigquery/v2/projects/biohackers-434920/queries/867f9646-65c1-44df-b4e0-fcb86ce9c296?maxResults=0&location=US&prettyPrint=false: Already Exists: Table biohackers-434920:views.austin_enrollments_by_school_grade_year

Location: US
Job ID: 867f9646-65c1-44df-b4e0-fcb86ce9c296

Creating Views for our queries

In [9]:
%%bigquery
create view views.reduced_lunch_count_per_district_state_type as
SELECT district_state_type, count(free_and_reduced) as free_and_reduced_school_count from school_enrollments.ca
WHERE district_state_type != ''
GROUP BY district_state_type
HAVING free_and_reduced_school_count > 1000
ORDER BY free_and_reduced_school_count ASC;

Executing query with job ID: 08b539fc-0a03-4e4e-a42c-48ba4c299a9f
Query executing: 0.21s

ERROR:
 409 GET https://bigquery.googleapis.com/bigquery/v2/projects/biohackers-434920/queries/08b539fc-0a03-4e4e-a42c-48ba4c299a9f?maxResults=0&location=US&prettyPrint=false: Already Exists: Table biohackers-434920:views.reduced_lunch_count_per_district_state_type

Location: US
Job ID: 08b539fc-0a03-4e4e-a42c-48ba4c299a9f

In [10]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   4320
1     AKINS H S          grade_10  2021   4482
2     AKINS H S          grade_11  2020   3984
3     AKINS H S          grade_11  2021   3978
4     AKINS H S          grade_12  2020   3654
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    414
1735  ZILKER EL      kindergarten  2020    462
1736  ZILKER EL      kindergarten  2021    378
1737  ZILKER EL  pre_kindergarten  2020    180
1738  ZILKER EL  pre_kindergarten  2021     78

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 3 homework marker. Start homework from here.

In [11]:
# for the hw both of us should do 4 aggregate querries 
# per each of us: 2 of our querries need Having, 2 need where, 1 needs union
# we will each pick our most intersting querry and visualize it
# make comments per querry

In [12]:
%%bigquery
SELECT * FROM school_enrollments.INFORMATION_SCHEMA.TABLES

Query is running:   0%|          |

Downloading:   0%|          |

,table_catalog,table_schema,table_name,table_type,is_insertable_into,is_typed,creation_time,base_table_catalog,base_table_schema,base_table_name,...,ddl,default_collation_name,upsert_stream_apply_watermark,replica_source_catalog,replica_source_schema,replica_source_name,replication_status,replication_error,is_change_history_enabled,sync_status
0,biohackers-434920,school_enrollments,mn,BASE TABLE,YES,NO,2024-10-21 18:21:37.705000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
1,biohackers-434920,school_enrollments,tx,BASE TABLE,YES,NO,2024-10-21 18:22:28.370000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
2,biohackers-434920,school_enrollments,sc,BASE TABLE,YES,NO,2024-10-21 18:22:20.897000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
3,biohackers-434920,school_enrollments,ok,BASE TABLE,YES,NO,2024-10-21 18:22:04.941000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
4,biohackers-434920,school_enrollments,pa,BASE TABLE,YES,NO,2024-10-21 18:22:14.170000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
5,biohackers-434920,school_enrollments,ar,BASE TABLE,YES,NO,2024-10-21 18:20:45.564000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
6,biohackers-434920,school_enrollments,wy,BASE TABLE,YES,NO,2024-10-21 18:22:44.609000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
7,biohackers-434920,school_enrollments,ca,BASE TABLE,YES,NO,2024-10-21 18:20:59.109000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
8,biohackers-434920,school_enrollments,la,BASE TABLE,YES,NO,2024-10-21 18:21:21.721000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
9,biohackers-434920,school_enrollments,ms,BASE TABLE,YES,NO,2024-10-21 18:21:43.512000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
10,biohackers-434920,school_enrollments,ak,BASE TABLE,YES,NO,2024-10-21 18:20:36.731000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
11,biohackers-434920,school_enrollments,ct,BASE TABLE,YES,NO,2024-10-21 18:21:07.061000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
12,biohackers-434920,school_enrollments,nv,BASE TABLE,YES,NO,2024-10-21 18:21:56.445000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
13,biohackers-434920,school_enrollments,hi,BASE TABLE,YES,NO,2024-10-21 18:21:13.586000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
14,biohackers-434920,school_enrollments,md,BASE TABLE,YES,NO,2024-10-21 18:21:28.601000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
15,biohackers-434920,school_enrollments,wa,BASE TABLE,YES,NO,2024-10-21 18:22:38.065000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None
16,biohackers-434920,school_enrollments,nh,BASE TABLE,YES,NO,2024-10-21 18:21:50.055000+00:00,None,None,None,...,CREATE TABLE `biohackers-434920.school_enrollm...,NULL,NaT,None,None,None,None,None,NO,None

Of schools in the conecticut talbe, sum disability and total students grouping by district where the percentage of students identifying as having a disability is greater than 20% of the student body using the having clause. Order by total_disability with greatest at the top. Utilize the replace function to replace all * as 0 and cast variables from string to numeric types

In [13]:
%%bigquery
SELECT sum(safe_cast(replace(disability, '*', '0') as float64)) as total_disability, sum(cast(replace(total, '*', '0') as int64)) as total_students, district FROM school_enrollments.ct
GROUP BY district
HAVING total_disability > total_students * .2
ORDER BY total_disability DESC;

Query is running:   0%|          |

Downloading:   0%|          |

,total_disability,total_students,district
0,12390.0,53568,Cooperative Educational Services
1,4398.0,9804,Unified School District #1
2,2628.0,10830,EdAdvance
3,1842.0,5118,Unified School District #2
4,42.0,84,Department of Mental Health and Addiction Serv...

Union the LA table and the SC table together through the subquerry, selecting state, low_income, and total. From that union dataframe, sum the amount of students identified as low income divided by the amount of total students grouped by state to find the relative amount of students per state identifying as low income. Order by relative_low_income with lowest instances coming first. Within the union, use a where clause where total students needs to be greater than 0 in order to be included.

In [14]:
%%bigquery
SELECT state, sum(safe_cast(low_income as float64)) / sum(safe_cast(total as int64)) as relative_low_income FROM 
(SELECT state, low_income, total from school_enrollments.sc 
WHERE total > 0
UNION ALL
SELECT state, low_income, total from school_enrollments.la
WHERE total > 0)
GROUP BY state
ORDER BY relative_low_income ASC;

Query is running:   0%|          |

Downloading:   0%|          |

  state  relative_low_income
0    SC             0.305145
1    LA             0.355206

Of the la database, takes the average amount of students who identify as low income per admin_level. Uses the where clause to exclude where safe_cast produces a null value or where the original low_income variable equaled null, indicating no schools with missing or incorrectly entered values for low_income will be included. Order by average_low_income with the highest coming first. Need to use safe_cast to transform the low_income column from string to float64.

In [15]:
%%bigquery
SELECT admin_level, avg(safe_cast(low_income as float64)) as average_low_income FROM school_enrollments.la
WHERE safe_cast(low_income as float64) is not null and low_income is not null
GROUP BY admin_level
ORDER BY average_low_income DESC;

Query is running:   0%|          |

Downloading:   0%|          |

  admin_level  average_low_income
0    district         6231.929752
1      school          357.927376

For schools from california, select district_state_type using the where clause to exclude the one district_state_type that was the empty string. Group by district_state_type, counting free_and_reduced to get the number of schools per district state type of school that have students participating in free and reduced lunch. Use the having clause to only include district_state_types where the amount of schools with students using free and reduced lunch is greater than 1000. Order by decreasing order of the amount of schools providing free and reduced lunch per district_state_type

In [16]:
%%bigquery
SELECT district_state_type, count(free_and_reduced) as free_and_reduced_school_count from school_enrollments.ca
WHERE district_state_type != ''
GROUP BY district_state_type
HAVING free_and_reduced_school_count > 1000
ORDER BY free_and_reduced_school_count ASC;

Query is running:   0%|          |

Downloading:   0%|          |

                district_state_type  free_and_reduced_school_count
0         Statewide Benefit Charter                           1596
1          State Board of Education                           4620
2  County Office of Education (COE)                          63252
3              High School District                          97272
4        Elementary School District                         433104
5           Unified School District                        1174152

For schools from Texas, find the total number of districts per county, excluding Dallas county, in descending order.

In [27]:
%%bigquery
SELECT county, count(DISTINCT district) AS total_district FROM school_enrollments.tx
WHERE county != 'DALLAS COUNTY'
GROUP BY county
ORDER BY total_district DESC;

Query is running:   0%|          |

Downloading:   0%|          |

              county  total_district
0      HARRIS COUNTY              56
1       BEXAR COUNTY              39
2     TARRANT COUNTY              25
3      TRAVIS COUNTY              23
4    MCLENNAN COUNTY              21
..               ...             ...
247    MOTLEY COUNTY               1
248    COTTLE COUNTY               1
249   BRISCOE COUNTY               1
250   TERRELL COUNTY               1
251    KENEDY COUNTY               1

[252 rows x 2 columns]

For district types in New Hampshire and Hawaii, find the count of each type, and sort by that count.

In [93]:
%%bigquery
SELECT DISTINCT state, ccd_district_type, ccd_district_type_count FROM
(SELECT state, safe_cast(ccd_district_type as string) as ccd_district_type, count(ccd_district_type) as ccd_district_type_count FROM school_enrollments.nh
 GROUP BY state, district, ccd_district_type
 HAVING ccd_district_type_count != 0
UNION ALL
SELECT state, safe_cast(ccd_district_type as string) as ccd_district_type, count(ccd_district_type) as ccd_district_type_count FROM school_enrollments.hi
 WHERE ccd_district_type is not null
 GROUP BY state, district, ccd_district_type
 HAVING ccd_district_type_count < 100000
)

ORDER BY ccd_district_type_count;

Query is running:   0%|          |

Downloading:   0%|          |

  state ccd_district_type  ccd_district_type_count
0    NH                 7                      102
1    NH                 2                      204
2    NH                 7                      204
3    NH                 1                      204
4    HI               1.0                      630

Find the average number of english language learners per district by county and district. Order the results alphabetically by district.

In [115]:
%%bigquery
SELECT county, district, AVG(ell) as avg_ell FROM school_enrollments.wa
GROUP BY county, district
HAVING avg_ell > 0
ORDER BY district ASC;

Query is running:   0%|          |

Downloading:   0%|          |

           county                   district     avg_ell
0    Grays Harbor   Aberdeen School District   19.766831
1           Lewis       Adna School District    0.202765
2          Skagit  Anacortes School District    3.980198
3       Snohomish  Arlington School District   12.613559
4            King     Auburn School District   71.089577
..            ...                        ...         ...
258         Lewis    Winlock School District    8.153846
259       Cowlitz   Woodland School District   12.525301
260        Yakima     Yakima School District  114.017015
261      Thurston       Yelm School District    6.714044
262        Yakima     Zillah School District   18.345992

[263 rows x 3 columns]

Find the total number of low income students in each district, returning a table with country, district, and the total number of low income students. Sort in descending order and exclude total_low_income values which are null.

In [113]:
%%bigquery
SELECT county, district, SUM(safe_cast(low_income as int)) as total_low_income FROM school_enrollments.pa
WHERE low_income != ''
GROUP BY county, district
HAVING total_low_income is not null
ORDER BY total_low_income DESC;

Query is running:   0%|          |

Downloading:   0%|          |

         county                        district  total_low_income
0       Chester               Owen J Roberts SD             11874
1         Perry                   West Perry SD             11598
2         Berks                 Hamburg Area SD             11568
3      Crawford                     Conneaut SD             11562
4        Beaver            New Brighton Area SD             11556
..          ...                             ...               ...
641     Montour  North Central Secure Trmnt Unt                 0
642      Monroe          Evergreen Community CS                 0
643     Montour  Danville Ctr Adolescent Female                 0
644  Cumberland           Cumberland Perry AVTS                 0
645       Bucks      Bucks County Montessori CS                 0

[646 rows x 3 columns]